ХМНПФ_Общее/DataProcessors/уп_ФормированиеРезерваЕВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ФормированиеРезерваЕВ</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_ПоступленияОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПоступленияОПС</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаКомпенсации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВосполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаКонцаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дополнительно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДополнительныеСведенияОВзносах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КатегорияСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_КатегорияВзносаОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_РезервыОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РезервыОПС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаКомпенсации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВосполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВозмещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Движение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ДокументРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДвиженияЕПС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.епс_ВидыДвиженияПенсионныхНакоплений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ТипыРезервовОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ТипыРезервовОПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервПенсионныйНакоплений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервСрочнойВыплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Выплатной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервЕВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийНП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийЕВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийРасторжение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийНаследованиеРПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийНаследованиеРСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийНаследованиеРОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийВозвратМСКРПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийВозвратМСКРСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНаследниковРПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНаследниковРСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийРазделениеСНИЛС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/DataProcessors/уп_ФормированиеРезерваЕВ/Forms/уф_Форма/Ext/Form/Module.bsl
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 08.09.2021 ШадринАВ // ОбработатьДокументПоступления() // №3325
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ОбработатьДокументПоступления")
Процедура ХМОбработатьДокументПоступления(ДокСсылка)
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	ДоговорыОПС.Ссылка.Дата КАК Период,
	|	ДоговорыОПС.Ссылка.Организация КАК Организация,
	|	ДоговорыОПС.Ссылка.ПенсионныйФонд КАК Плательщик,
	|	ДоговорыОПС.Ссылка.ДатаНачалаПериодаВзносов КАК ДатаНачалаПериодаВзносов,
	|	ДоговорыОПС.Ссылка.ДатаКонцаПериодаВзносов КАК ДатаКонцаПериода,
	|	ДоговорыОПС.ДоговорОПС КАК ДоговорОПС,
	|	ДоговорыОПС.Участник КАК Участник,
	|	&РПН КАК ТипРезерва,
	|	ДоговорыОПС.ТипСуммы КАК ТипСуммы,
	|	ДоговорыОПС.Сумма КАК Сумма,
	|	ДоговорыОПС.СуммаКомпенсации КАК СуммаКомпенсации,
	|	ДоговорыОПС.СуммаВосполнения КАК СуммаВосполнения
	|ПОМЕСТИТЬ ДоговорыОПС
	|ИЗ
	|	Документ.уп_ФинансовыйРеестр.ДоговорыОПС КАК ДоговорыОПС
	|ГДЕ
	|	ДоговорыОПС.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ДоговорОПС КАК ДоговорОПС,
	|	КОНЕЦПЕРИОДА(уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ДатаОбращения, КВАРТАЛ) КАК КварталОбращения,
	|	уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ВключатьДопВзносы КАК ВключатьДопВзносы,
	|	НАЧАЛОПЕРИОДА(уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ДатаОбращения, ГОД) КАК НачалоГодаОбращения,
	|	КОНЕЦПЕРИОДА(уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних.ДатаОбращения, ГОД) КАК КонецГодаОбращения
	|ПОМЕСТИТЬ ОбращенияЗаЕВ
	|ИЗ
	|	РегистрСведений.уп_ДатыОбращенияЗаЕдиновременнойВыплатой.СрезПоследних(
	|			&ДатаДок,
	|			ДоговорОПС В
	|				(ВЫБРАТЬ
	|					ДоговорыОПС.ДоговорОПС
	|				ИЗ
	|					ДоговорыОПС)) КАК уп_ДатыОбращенияЗаЕдиновременнойВыплатойСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ПоступленияОПСОбороты.ДоговорОПС КАК ДоговорОПС,
	|	уп_ПоступленияОПСОбороты.СуммаОборот КАК СуммаОборот,
	|	уп_ПоступленияОПСОбороты.ДатаКонцаПериода КАК ДатаКонцаПериода
	|ПОМЕСТИТЬ ВзносыГосПоддержки
	|ИЗ
	|	РегистрНакопления.уп_ПоступленияОПС.Обороты(
	|			,
	|			&ДатаДок,
	|			Период,
	|			ДоговорОПС В
	|					(ВЫБРАТЬ
	|						ОбращенияЗаЕВ.ДоговорОПС
	|					ИЗ
	|						ОбращенияЗаЕВ
	|					ГДЕ
	|						ОбращенияЗаЕВ.ВключатьДопВзносы = ИСТИНА)
	|				И ТипСуммы = &ГосПоддержка) КАК уп_ПоступленияОПСОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ПоступленияОПСОбороты.ДоговорОПС КАК ДоговорОПС,
	|	уп_ПоступленияОПСОбороты.СуммаОборот КАК СуммаОборот,
	|	уп_ПоступленияОПСОбороты.ДатаКонцаПериода КАК ДатаКонцаПериода
	|ПОМЕСТИТЬ ВзносыДСВ
	|ИЗ
	|	РегистрНакопления.уп_ПоступленияОПС.Обороты(
	|			,
	|			&ДатаДок,
	|			Период,
	|			ДоговорОПС В
	|					(ВЫБРАТЬ
	|						ОбращенияЗаЕВ.ДоговорОПС
	|					ИЗ
	|						ОбращенияЗаЕВ
	|					ГДЕ
	|						ОбращенияЗаЕВ.ВключатьДопВзносы = ИСТИНА)
	|				И ТипСуммы В (&ДСВ)) КАК уп_ПоступленияОПСОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбращенияЗаЕВ.ДоговорОПС КАК ДоговорОПС,
	|	ОбращенияЗаЕВ.КварталОбращения КАК КварталОбращения,
	|	ОбращенияЗаЕВ.ВключатьДопВзносы КАК ВключатьДопВзносы,
	|	ОбращенияЗаЕВ.НачалоГодаОбращения КАК НачалоГодаОбращения,
	|	ОбращенияЗаЕВ.КонецГодаОбращения КАК КонецГодаОбращения,
	|	СУММА(ВЫБОР
	|			КОГДА КОНЕЦПЕРИОДА(ВзносыГосПоддержки.ДатаКонцаПериода, ДЕНЬ) = КОНЕЦПЕРИОДА(ОбращенияЗаЕВ.КонецГодаОбращения, ДЕНЬ)
	|				ТОГДА ВзносыГосПоддержки.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма
	|ПОМЕСТИТЬ ГосПоддержкаЗаГодОбращения
	|ИЗ
	|	ОбращенияЗаЕВ КАК ОбращенияЗаЕВ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзносыГосПоддержки КАК ВзносыГосПоддержки
	|		ПО ОбращенияЗаЕВ.ДоговорОПС = ВзносыГосПоддержки.ДоговорОПС
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбращенияЗаЕВ.ДоговорОПС,
	|	ОбращенияЗаЕВ.КварталОбращения,
	|	ОбращенияЗаЕВ.ВключатьДопВзносы,
	|	ОбращенияЗаЕВ.НачалоГодаОбращения,
	|	ОбращенияЗаЕВ.КонецГодаОбращения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбращенияЗаЕВ.ДоговорОПС КАК ДоговорОПС,
	|	ОбращенияЗаЕВ.КварталОбращения КАК КварталОбращения,
	|	ОбращенияЗаЕВ.ВключатьДопВзносы КАК ВключатьДопВзносы,
	|	ОбращенияЗаЕВ.НачалоГодаОбращения КАК НачалоГодаОбращения,
	|	ОбращенияЗаЕВ.КонецГодаОбращения КАК КонецГодаОбращения,
	|	СУММА(ВЫБОР
	|			КОГДА ВзносыДСВ.ДатаКонцаПериода <= ОбращенияЗаЕВ.КварталОбращения
	|					И ВзносыДСВ.ДатаКонцаПериода > ОбращенияЗаЕВ.НачалоГодаОбращения
	|				ТОГДА ВзносыДСВ.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА ВзносыДСВ.ДатаКонцаПериода <= ОбращенияЗаЕВ.КонецГодаОбращения
	|					И ВзносыДСВ.ДатаКонцаПериода > ОбращенияЗаЕВ.НачалоГодаОбращения
	|				ТОГДА ВзносыДСВ.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДопВзносыЗаГод,
	|	СУММА(ВЫБОР
	|			КОГДА ВзносыДСВ.ДатаКонцаПериода <= ОбращенияЗаЕВ.КонецГодаОбращения
	|					И ВзносыДСВ.ДатаКонцаПериода > ОбращенияЗаЕВ.КварталОбращения
	|				ТОГДА ВзносыДСВ.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДопВзносыПосле
	|ПОМЕСТИТЬ ДСВЗаПериодОбращения
	|ИЗ
	|	ОбращенияЗаЕВ КАК ОбращенияЗаЕВ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзносыДСВ КАК ВзносыДСВ
	|		ПО ОбращенияЗаЕВ.ДоговорОПС = ВзносыДСВ.ДоговорОПС
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбращенияЗаЕВ.ДоговорОПС,
	|	ОбращенияЗаЕВ.КварталОбращения,
	|	ОбращенияЗаЕВ.ВключатьДопВзносы,
	|	ОбращенияЗаЕВ.НачалоГодаОбращения,
	|	ОбращенияЗаЕВ.КонецГодаОбращения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыОПС.ДоговорОПС КАК ДоговорОПС,
	|	ДоговорыОПС.Участник КАК Участник,
	|	ДоговорыОПС.ТипСуммы КАК ТипСуммы,
	|	ДоговорыОПС.ТипРезерва КАК ТипРезерва,
	|	ДоговорыОПС.Сумма КАК Сумма,
	|	ДоговорыОПС.СуммаКомпенсации КАК СуммаКомпенсации,
	|	ДоговорыОПС.СуммаВосполнения КАК СуммаВосполнения,
	|	ВЫБОР
	|		КОГДА ДоговорыОПС.ТипСуммы = &ГосПоддержка
	|			ТОГДА ЕСТЬNULL(ГосПоддержкаЗаГодОбращения.Сумма, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаГП,
	|	ВЫБОР
	|		КОГДА ДоговорыОПС.ТипСуммы = &ГосПоддержка
	|			ТОГДА ЕСТЬNULL(ДСВЗаПериодОбращения.Сумма, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДСВ,
	|	ОбращенияЗаЕВ.КварталОбращения КАК КварталОбращения,
	|	ОбращенияЗаЕВ.ВключатьДопВзносы КАК ВключатьДопВзносы,
	|	ОбращенияЗаЕВ.КонецГодаОбращения КАК КонецГодаОбращения,
	|	ОбращенияЗаЕВ.НачалоГодаОбращения КАК НачалоГодаОбращения,
	|	ДоговорыОПС.Период КАК Период,
	|	ДоговорыОПС.Организация КАК Организация,
	|	ДоговорыОПС.Плательщик КАК Плательщик,
	|	ДоговорыОПС.ДатаНачалаПериодаВзносов КАК ДатаНачалаПериодаВзносов,
	|	ДоговорыОПС.ДатаКонцаПериода КАК ДатаКонцаПериода,
	|	ЕстьNULL(ДСВЗаПериодОбращения.ДопВзносыЗаГод,0) КАК ДопВзносыЗаГод,
	|	ЕстьNULL(ДСВЗаПериодОбращения.ДопВзносыПосле,0) КАК ДопВзносыПосле
	|ИЗ
	|	ОбращенияЗаЕВ КАК ОбращенияЗаЕВ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоговорыОПС КАК ДоговорыОПС
	|		ПО ОбращенияЗаЕВ.ДоговорОПС = ДоговорыОПС.ДоговорОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГосПоддержкаЗаГодОбращения КАК ГосПоддержкаЗаГодОбращения
	|		ПО ОбращенияЗаЕВ.ДоговорОПС = ГосПоддержкаЗаГодОбращения.ДоговорОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДСВЗаПериодОбращения КАК ДСВЗаПериодОбращения
	|		ПО ОбращенияЗаЕВ.ДоговорОПС = ДСВЗаПериодОбращения.ДоговорОПС";

	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("ДатаДок", ДокСсылка.Дата);
	Запрос.УстановитьПараметр("ГосПоддержка", Справочники.уп_ТипыСуммОПС.ГосПоддержка);
	Запрос.УстановитьПараметр("РезервНаследников", Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН);
	Запрос.УстановитьПараметр("РПН", Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101000000');

	ДСВ = Новый СписокЗначений;
	ДСВ.Добавить(Справочники.уп_ТипыСуммОПС.ВзносыЮр);
	ДСВ.Добавить(Справочники.уп_ТипыСуммОПС.ДопВзносы);
	Запрос.УстановитьПараметр("ДСВ", ДСВ);
	Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.уп_РегистрацияПоступленийОПС") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "уп_ФинансовыйРеестр", "уп_РегистрацияПоступленийОПС");
	КонецЕсли;	

	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	НаборЗаписейРегистра	= РегистрыНакопления.уп_РезервыОПС.СоздатьНаборЗаписей();
	ОтборПоРегистратору = НаборЗаписейРегистра.Отбор.Регистратор;
	ОтборПоРегистратору.Установить(ДокСсылка);
	НаборЗаписейРегистра.Прочитать();
	ТаблицаНабора = НаборЗаписейРегистра.Выгрузить();
	ЕстьИзменения = Ложь;
	Пока Выборка.Следующий() Цикл
		ЗаменаТР = Ложь;
		ЗаменаСуммы = Ложь;
		Сумма = Выборка.Сумма;
		СуммаДоп = 0;
		Если ЗначениеЗаполнено(Выборка.КварталОбращения) Тогда
			Если Выборка.ТипСуммы = Справочники.уп_ТипыСуммОПС.ГосПоддержка Тогда
				#Вставка
				// +ХМНПФ 08.09.2021 ШадринАВ // ОбработатьДокументПоступления() // №3325	
				Если Выборка.ВключатьДопВзносы Тогда
				// -ХМНПФ 08.09.2021 ШадринАВ // ОбработатьДокументПоступления() // №3325 
				#КонецВставки
					Если ДокСсылка.ДатаКонцаПериодаВзносов < Выборка.НачалоГодаОбращения Тогда
						ЕстьИзменения = Истина;
						ЗаменаТР = Истина;
						//ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервЕВ;
					ИначеЕсли КонецДня(ДокСсылка.ДатаКонцаПериодаВзносов) = КонецДня(Выборка.КонецГодаОбращения) И Выборка.Сумма>0 Тогда
						//СуммаВРезервЕВ = Мин(ТекСтрокаДоговорыОПС.СуммаДСВ-ТекСтрокаДоговорыОПС.СуммаГП, ТекСтрокаДоговорыОПС.Сумма);
						Если Выборка.ДопВзносыЗаГод = 0 Тогда
							Сообщить("По документу "+ДокСсылка+" по договору ОПС "+Выборка.ДоговорОПС+" сумма гос поддержки за год обращения составляет "+Выборка.Сумма+", а сумма доп. взносов = 0. Резерв не может быть корректно сформирован.");
							СуммаВРезервЕВ = 0;
						Иначе
							Коэффициент = Выборка.Сумма/Выборка.ДопВзносыЗаГод;
							СуммаСФДолжнаОстаться = Окр(Выборка.ДопВзносыПосле*Коэффициент,2);
							СуммаВРезервЕВ = Выборка.Сумма - СуммаСФДолжнаОстаться;
							Если СуммаВРезервЕВ>0 Тогда
								ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервЕВ;
								Сумма = СуммаВРезервЕВ;
								ЗаменаТР = Истина;
								Если СуммаВРезервЕВ<Выборка.Сумма Тогда
									ЗаменаСуммы = Истина;
									СуммаДоп = Выборка.Сумма-СуммаВРезервЕВ;
								КонецЕсли;	
								ЕстьИзменения = Истина;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;	
				#Вставка
				// +ХМНПФ 08.09.2021 ШадринАВ // ОбработатьДокументПоступления() // №3325	
				КонецЕсли;	
				// -ХМНПФ 08.09.2021 ШадринАВ // ОбработатьДокументПоступления() // №3325
				#КонецВставки				
			Иначе
				Если ДокСсылка.ДатаКонцаПериодаВзносов <= Выборка.КварталОбращения Тогда
					ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервЕВ;
					ЗаменаТР = Истина;
					ЕстьИзменения = Истина;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
		Если ЕстьИзменения Тогда
			//СтрокаТаблицы = ТаблицаНабора.Найти(Выборка.ДоговорОПС, "ДоговорОПС");
			СтрокиТаблицы = ТаблицаНабора.НайтиСтроки(Новый Структура("ДоговорОПС, ТипРезерва, ТипСуммы, Сумма", Выборка.ДоговорОПС, Выборка.ТипРезерва, Выборка.ТипСуммы, Выборка.Сумма ));
			Если СтрокиТаблицы.Количество() = 1 Тогда
				СтрокаТаблицы = СтрокиТаблицы.Получить(0); 
				Если СтрокаТаблицы.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений Тогда
					Если ЗаменаТР Тогда
						СтрокаТаблицы.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервЕВ;
					КонецЕсли;	
					Если ЗаменаСуммы Тогда
						СтрокаТаблицы.Сумма = Сумма;
						НовСтрТаблицы = ТаблицаНабора.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтрТаблицы,СтрокаТаблицы);
						НовСтрТаблицы.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервЕВ;
						НовСтрТаблицы.Сумма = СуммаДоп; 
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	Если ЕстьИзменения Тогда
		НаборЗаписейРегистра.Загрузить(ТаблицаНабора);
		Попытка
			НаборЗаписейРегистра.Записать(Истина);
		Исключение
			#Вставка
			// +ХМНПФ 08.09.2021 ШадринАВ // ОбработатьДокументПоступления() // №3325
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка при обработке документа поступления: " + ДокСсылка;
			Сообщение.Сообщить();
			// -ХМНПФ 08.09.2021 ШадринАВ // ОбработатьДокументПоступления() // №3325
			#КонецВставки
		КонецПопытки;	
	КонецЕсли;	
КонецПроцедуры
